{
"dogBreeds":[

{
      "DogName": "affenpinscher",
      "description": "The Affenpinscher is a German breed of small toy dog of Pinscher type. Originally developed as a mouser, the Affenpinscher is now commonly found as a companion worldwide.",
      "dogType": "Toy"
    },
   { 
    "DogName": "african", 
    "description": "The Africanis is a dog landrace found across southern Africa. It is a medium-sized, short-coated dog, with a distinctive black patch on the outside of the tail.",
    "dogType": "Hound"
    },
    {
      "DogName": "airedale", 
      "description": "Known as the King of Terriers, the Airedale is indeed the largest of all terriers. The dog breed originated in the Aire Valley of Yorkshire, designed to catch otters and rats.",
      "dogType": "Terrier"
    },
    {
      "DogName": "akita",  
      "description": "The Akita is a large and powerful dog breed with a noble and intimidating presence. They were originally used for guarding royalty and nobility in feudal Japan.",
      "dogType": "Working"
    },
    {
      "DogName":"appenzeller", 
      "description": "The Appenzeller Sennenhund is a medium-sized herding dog from Switzerland, known for its versatility, intelligence, and high energy levels.",
      "dogType": "Herding"
    },
    {
      "DogName":"basenji", 
      "description": "The Basenji, often known as the 'barkless dog,' is a unique breed with a cat-like demeanor. Originating from Africa, they are known for their intelligence, independence, and inability to bark.",
      "dogType": "Hound"
    },
   { 
      "DogName":"beagle",  
     "description": "The Beagle is a small hound breed known for its incredible sense of smell and tracking ability. Friendly and curious, Beagles make great family pets.",
    "dogType": "Hound"
    },
    {"DogName": "boxer",  
      "description": "The Boxer is a medium to large-sized breed of working dog with a strong jaw and powerful bite. They are known for their loyalty, affection, and protective nature, making them great family pets.",
      "dogType": "Working"
    },
   {
     "DogName":"bulldog",  
      "description": "The Bulldog, also known as the English Bulldog, is distinguished by its loose, saggy skin and pushed-nose. They are known for their courage and excellent guarding abilities but are also gentle and affectionate.",
      "dogType": "Non-Sporting"
    },
    {
      "DogName":"chihuahua",  
      "description": "The Chihuahua is the smallest dog breed in the world, known for its lively and confident personality. Despite their tiny size, they are full of energy and fiercely loyal to their owners.",
      "dogType": "Toy"
    },
    {
      "DogName":"dalmatian", 
      "description": "Famous for their spotted coat and unique job description as carriage dogs, Dalmatians are high-energy, playful, and sensitive companions.",
      "dogType": "Non-Sporting"
    },
    {
      "DogName":"germanshepherd", 
      "description": "The German Shepherd is a versatile breed, known for its intelligence, courage, and loyalty. They are often used in police and military roles around the world.",
      "dogType": "Herding"
    },
    {
      "DogName": "labrador", 
      "description": "The Labrador Retriever is one of the most popular dog breeds in the United States. Known for their friendly nature, intelligence, and loyalty, Labradors make excellent family pets and companions.",
      "dogType": "Sporting"
    },
    {
      "DogName":"pug", 
      "description": "The Pug is a breed with a distinctive wrinkly face and curled tail. Known for their playful and affectionate nature, Pugs are great companions.",
      "dogType": "Toy"
    }
  ]
}